# Project Solution - Primary

You have to work on the [Kiva](https://drive.google.com/file/d/1-tJtnIbo1Rt-F1XfoWGVkmBXiI-ciuRx/view) dataset. Some information on the datasets are on the [Kaggle](https://www.kaggle.com/gaborfodor/additional-kiva-snapshot) web page.

## Basic tasks

**1.** Normalize the `loan_lenders` table. In the normalized table, each row must have one `loan_id` and one `lender`.

Firstly, csv file is read and data frame with unnormalized data is created:

In [1]:
import pandas as pd
import numpy as np
import time as tm
FINAL = False # This is final calculation, on complete data
start_time = tm.time()
loans_lenders_un = pd.read_csv('../../Datasets/kiva/loans_lenders.csv')
if not FINAL:
    loans_lenders_un = loans_lenders_un.head(10000) 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_lenders_un

--- 8.505559921264648 seconds ---

      loan_id                                            lenders
0      483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1      483738  muc888, nora3555, williammanashi, barbara5610,...
2      485000  muc888, terrystl, richardandsusan8352, sherri4...
3      486087  muc888, james5068, rudi5955, daniel9859, don92...
4      534428  muc888, niki3008, teresa9174, mike4896, david7...
...       ...                                                ...
9995    45940  helga4707, james6963, jimjams, andreas2382, si...
9996   247491  priyaram, christian9832, john9242, sandra1434,...
9997   345274  priyaram, nicola1093, bobby9744, simon7848, di...
9998   125945  joseph1859, matt5349, reese3555, stanley3312, ...
9999   225434  michael25572458, tom8330, garyk, manas8925, ma...

[10000 rows x 2 columns]

Data frame with structured data will be created with help of intermediate object - list of pairs (loan_id, lender) packed in the dictionary:

In [2]:
import time as tm
start_time = tm.time()
lis = []
for index, row in loans_lenders_un.iterrows(): 
    ls = row['lenders'].split(',')
    for l in ls:
        lis.append({ 'loan_id' : row['loan_id'], 'lender': l.strip() })
loans_lender = pd.DataFrame(lis) 
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_lender

--- 6.618005752563477 seconds ---

        loan_id             lender
0        483693             muc888
1        483693            sam4326
2        483693        camaran3922
3        483693        lachheb1865
4        483693        rebecca3499
...         ...                ...
245000   225434       wongacom3393
245001   225434  marleneanddel8151
245002   225434         joanne4956
245003   225434         juddie7070
245004   225434          keith7215

[245005 rows x 2 columns]

**2.** For each loan, add a column `duration` corresponding to the number of days between the disburse time and the planned expiration time. If any of those two dates is missing, also the duration must be missing.

Firstly, data frame should be loaded and structure of the data frame `loans` should be determined:

In [3]:
import pandas as pd
import numpy as np
import time as tm
start_time = tm.time()
loans = pd.read_csv('../../Datasets/kiva/loans.csv')
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans.columns

--- 61.659157514572144 seconds ---

Index(['loan_id', 'loan_name', 'original_language', 'description',
       'description_translated', 'funded_amount', 'loan_amount', 'status',
       'activity_name', 'sector_name', 'loan_use', 'country_code',
       'country_name', 'town_name', 'currency_policy',
       'currency_exchange_coverage_rate', 'currency', 'partner_id',
       'posted_time', 'planned_expiration_time', 'disburse_time',
       'raised_time', 'lender_term', 'num_lenders_total',
       'num_journal_entries', 'num_bulk_entries', 'tags', 'borrower_genders',
       'borrower_pictured', 'repayment_interval', 'distribution_model'],
      dtype='object')

After thar, values from the data frame should be displayed:

In [4]:
if not FINAL:
    loans = loans.head(20000)
loans

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,...,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,...,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,...,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,...,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,...,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,...,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19995,341198,Guillermo Antonio,Spanish,"El Señor Guillermo tiene 42 años, la ubicación...",Guillermo is 42 years old. His business is lo...,375.0,375.0,funded,Shoe Sales,Retail,...,2011-10-13 00:00:41.000 +0000,14.0,10,1,1,NaN,male,true,monthly,field_partner
19996,341771,ERLINDA,English,Erlinda is from the village of Sillawit. She i...,NaN,175.0,175.0,funded,General Store,Retail,...,2011-10-14 06:02:23.000 +0000,8.0,3,2,1,NaN,female,true,irregular,field_partner
19997,344237,Ma Guadalupe,Spanish,La señora Ma Guadalupe es madre de 2 hijos de ...,\r\nMaría Guadalupe is the mother of two child...,625.0,625.0,funded,Property,Housing,...,2011-10-27 19:23:44.000 +0000,14.0,23,1,1,NaN,female,true,monthly,field_partner
19998,344735,Blanca Lidia,Spanish,"Blanca, vive con su esposo, tiene tres hijos d...",Blanca lives with her husband and has three ch...,350.0,350.0,funded,Food Production/Sales,Food,...,2011-10-12 02:10:27.000 +0000,8.0,10,4,2,NaN,female,true,monthly,field_partner
19999,345313,Jackline,English,"Jackline is 30 years old, married, and a moth...",NaN,100.0,100.0,funded,Clothing,Clothing,...,2011-10-17 14:35:09.000 +0000,8.0,1,1,1,NaN,female,true,monthly,field_partner

We are now mainly interested in columns 'planned_expiration_time', 'disburse_time':

In [5]:
loans_sel = loans[ ['loan_id', 'loan_name','planned_expiration_time', 'disburse_time'] ]
loans_sel

,loan_id,loan_name,planned_expiration_time,disburse_time
0,657307,Aivy,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000
1,657259,Idalia Marizza,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000
2,658010,Aasia,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000
3,659347,Gulmira,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000
4,656933,Ricky\t,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000
...,...,...,...,...
19995,341198,Guillermo Antonio,NaN,2011-09-13 07:00:00.000 +0000
19996,341771,ERLINDA,NaN,2011-09-16 07:00:00.000 +0000
19997,344237,Ma Guadalupe,NaN,2011-10-07 07:00:00.000 +0000
19998,344735,Blanca Lidia,NaN,2011-09-16 07:00:00.000 +0000
19999,345313,Jackline,NaN,2011-09-23 07:00:00.000 +0000

In [6]:
from datetime import datetime as dt
import time as tm
start_time = tm.time()
loans['duration'] = None
for index, row in loans.iterrows(): 
    s2 = row['planned_expiration_time']
    s1 = row['disburse_time']
    if( pd.notna(s1) and pd.notna(s2) and s1 != '' and s2 != ''):
        d2 = dt.strptime(s2, "%Y-%m-%d %H:%M:%S.%f %z")
        d1 = dt.strptime(s1, "%Y-%m-%d %H:%M:%S.%f %z")
        loans.loc[index,'duration'] = (d2 - d1).days 
loans_sel = loans[ ['loan_id', 'loan_name','planned_expiration_time', 'disburse_time', 'duration'] ]
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_sel

--- 36.3748505115509 seconds ---

,loan_id,loan_name,planned_expiration_time,disburse_time,duration
0,657307,Aivy,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,53
1,657259,Idalia Marizza,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,96
2,658010,Aasia,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,37
3,659347,Gulmira,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,34
4,656933,Ricky\t,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,57
...,...,...,...,...,...
19995,341198,Guillermo Antonio,NaN,2011-09-13 07:00:00.000 +0000,None
19996,341771,ERLINDA,NaN,2011-09-16 07:00:00.000 +0000,None
19997,344237,Ma Guadalupe,NaN,2011-10-07 07:00:00.000 +0000,None
19998,344735,Blanca Lidia,NaN,2011-09-16 07:00:00.000 +0000,None
19999,345313,Jackline,NaN,2011-09-23 07:00:00.000 +0000,None

**3.** Find the lenders that have funded at least twice.

- Those are lenders that are duplicated in structured loan_leneders dataframe.

This solution is based on panda functionality:

In [7]:
import time as tm
start_time = tm.time()
loans_lender_2_more = loans_lender[loans_lender.duplicated(['lender'])]
lenders_funded_2_more = list(set(loans_lender_2_more['lender']))
print("--- %s seconds ---" % (tm.time()-start_time)) 
lenders_funded_2_more

--- 0.20475077629089355 seconds ---

['greg2665',
 'hildie7244',
 'aparna3045',
 'neil000',
 'dyljord',
 'ray3465',
 'rupert3346',
 'mark8179',
 'johnandpamela7232',
 'miaandjulius5424',
 'annette2115',
 'jennifer69991466',
 'stephenayer',
 'boscoboy',
 'alexallain8823',
 'vicki5836',
 'thomas84089088',
 'ann3371',
 'william3335',
 'teamkiva447',
 'isabella7927',
 'ned5521',
 'sheldon7826',
 'monique6351',
 'craig5809',
 'anita1483',
 'steve9001',
 'KivaKam',
 'glenn4833',
 'lars3725',
 'ruben2186',
 'tom2369',
 'marcia5372',
 'keith3212',
 'dan3261',
 'vincent5760',
 'dene3629',
 'cmohan',
 'jill3687',
 'michael87264695',
 'margaret3470',
 'gloria8548',
 'mziegler',
 'melissa9505',
 'jason5372',
 'birgitta88348122',
 'holly5010',
 'kim7043',
 'marisa6726',
 'nazar3049',
 'fabian2025',
 'rob6109',
 'spmoran',
 'todd3515',
 'jeukku',
 'codyandjessica5495',
 'ann5887',
 'haruaki7434',
 'anon23456',
 'MironProperties',
 'pat8621',
 'martina9674',
 'dick3396',
 'alex7677',
 'elaine3551',
 'nils3432',
 'leah5422',
 'nancy3672',
 'kingsley5519',
 'wafa7578',
 'caleb9257',
 'angela18169478',
 'carlos4463',
 'gernot9073',
 'barbara8436',
 'sasha1550',
 'gabriele3071',
 'goncalo2244',
 'tonia2441',
 'amar2352',
 'martin8301',
 'vijayandtripta1646',
 'jorunn5268',
 'eileen6988',
 'aarrieta',
 'david6445',
 'venus4252',
 'ash5112',
 'heather9907',
 'shelley3924',
 'nils9902',
 'tamas6277',
 'roy4185',
 'simon6770',
 'gregor5108',
 'paul6421',
 'david5920',
 'james3774',
 'annes5483',
 'sega1075',
 'phyllis2903',
 'pachinko',
 'nayminthu',
 'amira7005',
 'mariev4298',
 'g9980',
 'dieter2536',
 'kay7637',
 'alessandraelorenzo',
 'vincent1802',
 'kai1969',
 'alina4647',
 'dannyroa',
 'joelcalhoun',
 'linda8152',
 'vickie1410',
 'matt1987',
 'MarcelD',
 'johanna5069',
 'heli7594',
 'mark8011',
 'petter8230',
 'jonas3556',
 'michael2788',
 'lee5776',
 'david53044526',
 'jamescsmith',
 'jessie8413',
 'emma4490',
 'melissa7211',
 'monica6408',
 'wayneanddanie5406',
 'david27269504',
 'garyandcheryl6292',
 'anthony3895',
 'eM4544',
 'daniel4879',
 'gary4650',
 'carrie6903',
 'alexanddeb6645',
 'louise1800',
 'anthony4960',
 'mimi3639',
 'johndesmond6644',
 'ddimitrov',
 'susan6331',
 'nicolette7896',
 'cristina1461',
 'lena1855',
 'nikaso',
 'megan9865',
 'vipul5419',
 'bodza',
 'valerie5339',
 'elisabeth4060',
 'gary6694',
 'bernmutt',
 'mjt91',
 'sarah37218612',
 'fredrik6652',
 'carolyn8017',
 'mercedsunriserotary2807',
 'claudio9220',
 'ryan70157125',
 'utku6378',
 'arluison',
 'nex8593',
 'larryp1705',
 'mitchell3272',
 'CamoJ',
 'jlapenna',
 'ayesha7872',
 'cindy6790',
 'aznsclboi',
 'roger2839',
 'thomas3810',
 'arlene7660',
 'allan3150',
 'paul9258',
 'manuelandjulia4214',
 'alexander3364',
 'phillip3099',
 'cato8697',
 'hilkka6055',
 'joshuad',
 'ries5734',
 'mirko',
 'louise1987',
 'marianne6592',
 'sas1597',
 'stephen8206',
 'hugues4782',
 'sandra8633',
 'meagan3516',
 'peterjames',
 'jane3995',
 'iqbal8403',
 'anton6310',
 'patrick5346',
 'kevin1897',
 'frank8926',
 'jason60148321',
 'elizabeth35497592',
 'jessica2327',
 'timothy2335',
 'jaime6726',
 'michelle3413',
 'bo9809',
 'jenny2383',
 'bruce2006',
 'lakemiddleschoolkiva4866',
 'DUDES',
 'brockfamily',
 'stmarysschool8117',
 'neilhong',
 'arielyve',
 'patice8452',
 'martinisaksen',
 'luke2791',
 'joanne49784342',
 'collins8770',
 'wendy9148',
 'charles6079',
 'donaldchase',
 'timothy6485',
 'angie6388',
 'jwhitmire',
 'matthias1958',
 'sally7826',
 'frank1250',
 'jim5572',
 'sythem',
 'migmigmig',
 'emily96531995',
 'chris6641',
 'scott7552',
 'michael7107',
 'guillermo3953',
 'kivalenders9609',
 'ann8082',
 'david4321',
 'istoria',
 'nancy5888',
 'russell4728',
 'david61882336',
 'tianna4764',
 'jeff8697',
 'tamara4887',
 'gil3473',
 'eric44698474',
 'bellasgoodkarma8157',
 'fay1493',
 'charles55',
 'greg7201',
 'chris9445',
 'matt4851',
 'enumkt3727',
 'cindy9335',
 'kelly4465',
 'melissa3642',
 'mike3589',
 'maryelizabeth8999',
 'lisa9134',
 'joseph34773179',
 'jana3461',
 'scott6885',
 'susan5850',
 'alanmacdonald',
 'peter9400',
 'susanne2991',
 'rayandmaureen5211',
 'snuggle',
 'larry7191',
 'cubsandfins',
 'jesper5890',
 'michael71823335',
 'matt',
 'michael28248294',
 'karen22919799',
 'mark6580',
 'gregor1923',
 'mikeandjulie8013',
 'tormod7495',
 'marcy6080',
 'maude6519',
 'patricia8183',
 'simone6258',
 'pete7837',
 'bonnie2506',
 'laetitia9792',
 'jonathanleger',
 'haden',
 'maria6604',
 'shannon3085',
 'kimberly8717',
 'penny10515221',
 'jay4549',
 'catalina8451',
 'jaypantone',
 'bill7564',
 'karin86929296',
 'hidenori1251',
 'dominic1154',
 'andres9142',
 'georgia6404',
 'lisa13035548',
 'guycoss',
 'berthil2363',
 'kristina2324',
 'thomas4511',
 'roger9467',
 'angela9212',
 'MHP',
 'bob1184',
 'andrew9411',
 'laurence6455',
 'Anayah9514',
 'elizabeth8801',
 'm2108',
 'mark73795091',
 'brad2122',
 'matthew9814',
 'shrley8666',
 'brie5458',
 'ron6749',
 'daveapplegate',
 'christel9917',
 'alison4880',
 'ronandbonnie4665',
 'david40892223',
 'patty5807',
 'stephen6353',
 'perilouspete',
 'alexander5847',
 'rex7886',
 'elambert',
 'marjorie4354',
 'tanya4964',
 'jim1230',
 'leon3805',
 'timothy7699',
 'mary4670',
 'joseph4064',
 'lindsay6510',
 'mcptalentagency2340',
 'kevin6961',
 'liana4963',
 'steven2126',
 'scott9873',
 'becky6578',
 'carolynlee6091',
 'newfrontierdigital',
 'terri2864',
 'abbey1636',
 'ellie1027',
 'kathryn4546',
 'claire1862',
 'mary8040',
 'wellshire3457',
 'cynthia6900',
 'sandy3614',
 'arthur3895',
 'britt1482',
 'michael6944',
 'belindajulian',
 'dfisaacs',
 'amy1854',
 'ute6174',
 'graham3961',
 'preetham3908',
 'orestis4265',
 'philip4493',
 'rochelle7043',
 'courtney9362',
 'craigandmary9443',
 'jennifer5902',
 'gustaafvocking',
 'leif4708',
 'nicolle9165',
 'dan8316',
 'natalie10632137',
 'roger46734530',
 '1961',
 'lena4852',
 'jeff6160',
 'cyrille2876',
 'stephanie6368',
 'annie1143',
 'claudia8161',
 'shaun3027',
 'shelley1728',
 'midayani3582',
 'thakoorandrita8388',
 'gnter4219',
 'megan3225',
 'menian',
 'brian5818',
 'barb8479',
 'radek2812',
 'michael63611916',
 'carol6655',
 'ronanddebi',
 'susan2375',
 'howard3769',
 'david6758',
 'janice4354',
 'mike1636',
 'rebeca7244',
 'clara5963',
 'will6468',
 'abigail4829',
 'jarleif',
 'jayblankespoor',
 'chrisandwy5211',
 'isa9325',
 'angela8128',
 'thomas9759',
 'diana5502',
 'karinhermann8282',
 'cary5117',
 'leah8665',
 'gerald7347',
 'eric1691',
 'janice39812803',
 'steven6753',
 'pat2528',
 'mentalworkout',
 'GoldmanSachs',
 'patricia7558',
 'amanbakshi',
 'taowins',
 'martijn7274',
 'julie5822',
 'Drjuergen',
 'jane3909',
 'david2530',
 'anne1439',
 'ryker',
 'harpreet',
 'pixelspoke',
 'jeremy5041',
 'christian4455',
 'linda9978',
 'dwight8849',
 'eleanor8380',
 'sharon8321',
 'sara3007',
 'david6011',
 'suzanne4376',
 'peter7883',
 'danny3973',
 'alexandra9167',
 'bayridgeelementary2591',
 'lisa7759',
 'ernielam',
 'brigitta5271',
 'johan1174',
 'james9801',
 'iain3331',
 'lisa9443',
 'daniel2177',
 'doug3067',
 'mona1327',
 'dgreno',
 'antonia7134',
 'tony9147',
 'meredith1353',
 'shawn8276',
 'lynn5611',
 'waltersystems3228',
 'stianedvin3097',
 'howard3887',
 'misty9523',
 'margaret3599',
 'peter63404991',
 'petraandscott8422',
 'jutta6013',
 'stuart7448',
 'ncschackel',
 'kathy9788',
 'joyce2673',
 'vincent1453',
 'mark1749',
 'scottandlauren4623',
 'nancy6896',
 'brock2344',
 'shawn1720',
 'jonathan2495',
 'ladyli5242',
 'shelley5664',
 'mayo4304',
 'anujraj',
 'farouk5788',
 'alexandraredisch',
 'esther3551',
 'jeri6305',
 'ray1511',
 'niels1742',
 'kofi3690',
 'don6098',
 'carolyn6138',
 'caesaraugustus3551',
 'cheri7682',
 'sheriandfred7942',
 'david1840',
 'fae6152',
 'eddiesmit',
 'philip9173',
 'david77415492',
 'markandtricia6704',
 'sherry9184',
 'julie2627',
 'rebecca5074',
 'sean3201',
 'christian7581',
 'lance7885',
 'shayden9664',
 'mauramchugh',
 'rlc3977',
 'joy2880',
 'jkowing',
 'gweigion',
 'bradandhaze3364',
 'isak',
 'Emily222',
 'hypnosistrainingacademy',
 'stephen6398',
 'renate6541',
 'george1745',
 'andrea5519',
 'nctrlnet',
 'janhiroshi2998',
 'fundamental',
 'ernestine7997',
 'hrafnar',
 'margaret68985206',
 'czjahu',
 'fergus6553',
 'P2PMinhNguyen2',
 'mikael2901',
 'stevefal',
 'ingeborg3162',
 'kevin82085176',
 'judith3447',
 'ann4180',
 'greg1303',
 'elizabeth9543',
 'daven2482',
 'andrew7793',
 'dcarrero',
 'carlee3439',
 'jchath6900',
 'marianne8828',
 'damiensuzie2552',
 'veronica5306',
 'hiroshi5831',
 'eric5983',
 'simon7324',
 'Geertjan',
 'gwen85599073',
 'warren3455',
 'mitchell9931',
 'jeff1954',
 'portraitfotokunst',
 'nadine8476',
 'henri3949',
 'debbie5160',
 'bill9445',
 'lonnie9403',
 'andrewlloyd',
 'angela8087',
 'loredana4078',
 'tom1764',
 'emily1464',
 'andrew1249',
 'mattiaslaven',
 'paul9010',
 'onliveit',
 'oxo1935',
 'helen9955',
 'tom1109',
 'iamjasonmills',
 'genecynthia9078',
 'johannes4789',
 'barbara53787733',
 'susan7983',
 'suzannah8438',
 'ali1493',
 'leslie2192',
 'duncan8885',
 'larryandmeg7009',
 'antony4150',
 'david63077785',
 'stuart3524',
 'map',
 'vicki3154',
 'lemsfamily8690',
 'andrew89497995',
 'hope4606',
 'miriam2740',
 'kozo6810',
 'jamey3794',
 'kevin7861',
 'peter91771608',
 'takbiir',
 'jesse3233',
 'lady1199',
 'miek68',
 'allan3519',
 'ralph4429',
 'kurt1357',
 'llh',
 'george8599',
 'ian7566',
 'eileen3524',
 'fran7422',
 'jzmdki5633',
 'allieo',
 'michael64691171',
 'vic8011',
 'lawrence1939',
 'christine3644',
 'jens3161',
 'zengarten',
 'patrick70527335',
 'lena',
 'bradley9146',
 'yutakasaguides',
 'teamsupportservices6502',
 'janice3211',
 'jeana8583',
 'timalex6409',
 'd4n0',
 'mathieugaulin',
 'suraj8610',
 'alexander1981',
 'jpeto',
 'victoria2744',
 'trevorb',
 'pravda2009',
 'birthe2316',
 'guy4029',
 'lm2',
 'Grindcore',
 'travis2046',
 'nicholasluder',
 'benedetta1974',
 'JonathanEarl',
 'tone3431',
 'ryan5796',
 'mikael7841',
 'giblfiz',
 'david2263',
 'tom8152',
 'katherine2558',
 'davinareto',
 'eeuwigheid',
 'watergirl',
 'jonathan3169',
 'vinhdat4024',
 'maryjane2957',
 'warren1464',
 'hammie1977',
 'sharon7957',
 'globalpatentsolution8479',
 'eddie2252',
 'wouter2540',
 'eric5133',
 'ralph5454',
 'michiko6641',
 'greggsonnenburg',
 'andrew3000',
 'ping898',
 'julieandpeter1940',
 'tatsuo1974',
 'ari7460',
 'linda21888115',
 'gilbertl',
 'marianne8308',
 'heychrisfox',
 'dana3224',
 'stine8514',
 'les6977',
 'susan3437',
 'michaelhaack',
 'don4934',
 'matthew7388',
 'rebecca2233',
 'wayne1573',
 'greg5694',
 'nicholls1640',
 'sarah7187',
 'kenneth2847',
 'willibald9710',
 'barryr',
 'bob74802412',
 'madhu8048',
 'troy7614',
 'danquinn5694',
 'rossching',
 'lennart9032',
 'elaine1609',
 'esther7143',
 'mike64433751',
 'steven6920',
 'david8133',
 'feastofvictorylut7585',
 'grace3555',
 'peter7303',
 'lois3870',
 'klauslovgreen',
 'joe4820',
 'barbara7387',
 'steve4651',
 'paul9056',
 'albert2908',
 'TheCorrectChange',
 'andybourgeois',
 'linda5410',
 'pomegranate5507',
 'loris1983',
 'arjen8681',
 'miriana5971',
 'todd3509',
 'lalenya8281',
 'brandon8823',
 'katerina4646',
 'svoberoi',
 'debbi9163',
 'prity8116',
 'joeanddebbie4925',
 'steve3540',
 'isbjorn',
 'jan6672',
 'fuckinyeah',
 'maryanne1309',
 'wayne4972',
 'susan9031',
 'keith2494',
 'nathan4269',
 'william8761',
 'kevin2815',
 'albert3192',
 'gerg6699',
 'joymwhyte',
 'karen1137',
 'rick7555',
 'robert2335',
 'sarah7042',
 'Jackelizabeth',
 'kedsarin4695',
 'alexandra9794',
 'sabine6022',
 'elyse1420',
 'carriespice',
 'debulition',
 'julie8396',
 'ericandsherri3312',
 'sandor7527',
 'margie',
 'buntypatel',
 'remco3334',
 'cable',
 'robert94147758',
 'laura6374',
 'cynthia6496',
 'zazi',
 'steve2610',
 'meredith7339',
 'carolineandsteve2978',
 'marcia2815',
 'bcwhite',
 'calvincorreli',
 'kristine2262',
 'CRL',
 'edward3139',
 'lawrencemanyiu8409',
 'najlah6163',
 'jaye2087',
 'fabrizio2142',
 'janet8942',
 'james1569',
 'ashish5575',
 'kathy6218',
 'krissyandsteve1907',
 'jennifer2247',
 'jim5285',
 'riley3772',
 'megan2113',
 'thewestbestweddin4251',
 'kate4058',
 'glenn6917',
 'euribe8042',
 'takashi5838',
 'jay2660',
 'steve5979',
 'leanne5754',
 'drewandcarmen4527',
 'mary2872',
 'brendaninminneapolis',
 'nils8609',
 'owain2266',
 'patrick3351',
 'henry2309',
 'tijmen',
 'carsten5804',
 'frank2817',
 'crystal3911',
 'andrew30801582',
 'chris1234',
 'patrick5643',
 'patrick6525',
 'jeff7677',
 'tovekristin6895',
 'marie2906',
 'inze',
 'robert3300',
 'david58843601',
 'patrick79503482',
 'david2947',
 'christianlouis',
 'mooreDNA',
 'kexft1161',
 'vic5854',
 'jeanmarc4189',
 'vineet7754',
 'emma3746',
 'wesley7260',
 'nicky8878',
 'john13383015',
 'sander7151',
 'mark7432',
 'kent1937',
 'owen2404',
 'karen6822',
 'nicholas3280',
 'richard6625',
 'rhondda4165',
 'elisabeth1',
 'helen6958',
 'richard6789',
 'leslie8824',
 'desiree37',
 'clive8268',
 'aileen5496',
 'steven2926',
 'susan1923',
 'dvnu',
 'robert7181',
 'margaret3245',
 'isa247',
 'cecilk',
 'martinandangela2008',
 'brody4463',
 'arthur4689',
 'joshua29616593',
 'shredd522',
 'joan7145',
 'istanbu8',
 'jennifer50281855',
 'reid4678',
 'catherine4741',
 'rob63748834',
 'shaun2819',
 'brenda6533',
 'donna8831',
 'steve6232',
 'snickn',
 'jesse6277',
 'angela7114',
 'wahiawa',
 'jan4781',
 'sunshine',
 'jessica1955',
 'mik63',
 'craig6772',
 'robertpechlof',
 'jo8159',
 'linda9698',
 'haricharan7243',
 'darlenerobert2832',
 'gail7925',
 'denise6312',
 'stephanie6928',
 'yasmina1100',
 'rebecca8795',
 'will5325',
 'david72967830',
 'balrog',
 'stuart1809',
 'joseandbarbara7990',
 'beverly2621',
 'drew4797',
 'david3551',
 'robert6421',
 'janet7989',
 'mary4832',
 'rolf9576',
 'gregandmc8353',
 'michael4929',
 'sharon7919',
 'paul7197',
 'daniel6534',
 'iain4702',
 'lawrence9529',
 'noah4417',
 'marie7919',
 'wade3530',
 'bryan5666',
 'ashutosh',
 'yulai2432',
 'sergio5803',
 'nathan9531',
 'bradandelaine4449',
 'kristoferandjessica3161',
 'tim7282',
 'ruth2782',
 'liana1892',
 'leonie994',
 'angela35589760',
 'kevin8831',
 'fabio8482',
 'walter1025',
 'rsriprac',
 'amos1170',
 'peter6879',
 'sharon2772',
 'yasmeen6600',
 'mark1492',
 'andrea2855',
 'michael1820',
 'vanessa2628',
 'ilsc9329',
 'john6252',
 'bobafett',
 'shannon2449',
 'afdesign',
 'phillip4141',
 'runar2615',
 'arif2273',
 'marc2700',
 'don9654',
 'matthew3467',
 'gooddogg1',
 'larry2354',
 'jane5799',
 'don9404',
 'laura3046',
 'pape',
 'steve28988492',
 'christopher4575',
 'marie1186',
 'roberto7709',
 'annanathan8608',
 'tagert',
 'diane8452',
 'vastanvinden',
 'joan1909',
 'finnwinther9737',
 'kerry3464',
 'jonathan3737',
 'sarah5304',
 'alan4706',
 'dalexander',
 'marty8019',
 'elisabet5742',
 'paul4412',
 'aj9337',
 'trevor5733',
 'brinkman6144',
 'chunto4976',
 'steve1641',
 'jeancharles6948',
 'roger1086',
 'scott3371',
 'fernando2100',
 'patricia1964',
 'nicholas5676',
 'mamie5789',
 'jkleinschmidt',
 'hughandlaura2929',
 'jk7698',
 'peter3339',
 'wayno',
 'teresa2864',
 'mike2265',
 'matthias8733',
 'sandie6561',
 'moe81',
 'robert3194',
 'sam5514',
 'scott7979',
 'lyn7791',
 'islmifi',
 'alice4597',
 'marc4334',
 'walter7463',
 'stephen9047',
 'angela1823',
 'krysia5524',
 ...]

**4.** For each country, compute how many loans have involved that country as borrowers.

- This solution is based on panda grouping:

In [8]:
import time as tm
start_time = tm.time()
loans_count = loans.groupby(['country_code','country_name'], as_index=False)[['loan_id']].count()
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_count

--- 0.016097307205200195 seconds ---

   country_code            country_name  loan_id
0            AF             Afghanistan       12
1            AL                 Albania       50
2            AM                 Armenia      212
3            AZ              Azerbaijan      109
4            BA  Bosnia and Herzegovina        1
..          ...                     ...      ...
73           XK                  Kosovo       51
74           YE                   Yemen       88
75           ZA            South Africa       16
76           ZM                  Zambia       18
77           ZW                Zimbabwe       91

[78 rows x 3 columns]

**5.** For each country, compute the overall amount of money borrowed.

- This solution is based on panda grouping:

In [9]:
import time as tm
start_time = tm.time()
loans_sum = loans.groupby(['country_code','country_name'], as_index = False)[['loan_amount']].sum()
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_sum

--- 0.013957977294921875 seconds ---

   country_code            country_name  loan_amount
0            AF             Afghanistan      11625.0
1            AL                 Albania      69800.0
2            AM                 Armenia     371075.0
3            AZ              Azerbaijan     205675.0
4            BA  Bosnia and Herzegovina        575.0
..          ...                     ...          ...
73           XK                  Kosovo      74950.0
74           YE                   Yemen      92100.0
75           ZA            South Africa      29000.0
76           ZM                  Zambia      32650.0
77           ZW                Zimbabwe      92700.0

[78 rows x 3 columns]

**6.** Like the previous point, but expressed as a percentage of the overall amount lent.

- This solution is based on panda functions:

In [10]:
import time as tm
start_time = tm.time()
loans_total = loans['loan_amount'].sum()
loans_percent = loans.groupby(['country_code','country_name'], as_index = False)[['loan_amount']].sum()
loans_percent['percent'] = loans_percent['loan_amount']/loans_total*100
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_percent

--- 0.04698657989501953 seconds ---

   country_code            country_name  loan_amount   percent
0            AF             Afghanistan      11625.0  0.069063
1            AL                 Albania      69800.0  0.414677
2            AM                 Armenia     371075.0  2.204531
3            AZ              Azerbaijan     205675.0  1.221901
4            BA  Bosnia and Herzegovina        575.0  0.003416
..          ...                     ...          ...       ...
73           XK                  Kosovo      74950.0  0.445273
74           YE                   Yemen      92100.0  0.547160
75           ZA            South Africa      29000.0  0.172287
76           ZM                  Zambia      32650.0  0.193971
77           ZW                Zimbabwe      92700.0  0.550724

[78 rows x 4 columns]

**7.** Like the three previous points, but split for each year (with respect to `disburse time`).

- This solution is based on panda functions:

In [13]:
import time as tm
start_time = tm.time()
from datetime import datetime as dt
loans_total = loans['loan_amount'].sum()
loans['disburse_time_year'] = None
for index, row in loans.iterrows(): 
    y = dt.strptime(row['disburse_time'], "%Y-%m-%d %H:%M:%S.%f %z").year
    loans.loc[index,'disburse_time_year'] = y 
loans_agg = loans.groupby(['country_code','country_name','disburse_time_year'], as_index = False).agg({'loan_amount':['count', 'sum', lambda x: x.sum()/loans_total*100]})
loans_agg.columns = loans_agg.columns.droplevel(0)
print("--- %s seconds ---" % (tm.time()-start_time)) 
loans_agg

--- 53.5970938205719 seconds ---

                            count      sum  <lambda_0>
0    AF  Afghanistan  2009     11  10450.0    0.062083
1    AF  Afghanistan  2010      1   1175.0    0.006981
2    AL      Albania  2012      5   4250.0    0.025249
3    AL      Albania  2013     15  19150.0    0.113769
4    AL      Albania  2014     16  27225.0    0.161742
..   ..          ...   ...    ...      ...         ...
514  ZW     Zimbabwe  2013      9  16450.0    0.097728
515  ZW     Zimbabwe  2014     47  31200.0    0.185357
516  ZW     Zimbabwe  2015      9   9150.0    0.054360
517  ZW     Zimbabwe  2016      7   8950.0    0.053171
518  ZW     Zimbabwe  2017     12  13300.0    0.079014

[519 rows x 6 columns]

**8.** For each lender, compute the overall amount of money lent. For each loan that has more than one lender, you must assume that all lenders contributed the same amount.

- This solution is based on panda functions:

In [14]:
import time as tm
start_time = tm.time()
merged = pd.merge(left=loans_lender,right=loans, left_on='loan_id', right_on='loan_id')
merged = merged[['loan_id','lender', 'loan_amount']]
number_of_lenders_by_loan_id = merged.groupby(['loan_id'], as_index = False)[['lender']].count()
number_of_lenders_by_loan_id
merged2 = pd.merge(left=merged,right=number_of_lenders_by_loan_id, left_on='loan_id', right_on='loan_id')
merged2['precise_amount'] = merged2.loan_amount / merged2.lender_y
merged2
lent_by_lender = merged2.groupby(['lender_x'], as_index = False)[['precise_amount']].sum()
print("--- %s seconds ---" % (tm.time()-start_time)) 
lent_by_lender
#result.loc[result['lender_x'] == 'muc888'] # result for one lender

--- 0.30820298194885254 seconds ---

                lender_x  precise_amount
0      100ofhumanity1199       64.583333
1             10yearitch       33.876812
2                 123321      153.990193
3           1ghostorchid       31.097561
4               1nottus1       43.750000
...                  ...             ...
19663         zubair1627       41.233766
19664              zubin      104.088235
19665               zuzu       25.714286
19666               zxdr       32.500000
19667           zzmcfate      196.912312

[19668 rows x 2 columns]

**9.** For each country, compute the difference between the overall amount of money lent and the overall amount of money borrowed. Since the country of the lender is often unknown, you can assume that the true distribution among the countries is the same as the one computed from the rows where the country is known.

In [15]:
import pandas as pd
import numpy as np
import time as tm
start_time = tm.time()
lenders = pd.read_csv('../../Datasets/kiva/lenders.csv')
if not FINAL:
    lenders = lenders.head(20000) 
lender_states = lenders[['permanent_name','country_code']]
lender_states

           permanent_name country_code
0                qian3013          NaN
1               reena6733          NaN
2                 mai5982          NaN
3          andrew86079135          NaN
4              nguyen6962          NaN
...                   ...          ...
19995         mohamed4338          NaN
19996  vicrennaisance8567          NaN
19997           mariz6787          NaN
19998          julian2868          NaN
19999         lestine1570          NaN

[20000 rows x 2 columns]

In [16]:
lenders_in_states = lender_states.loc[lender_states['country_code'].notnull()]
lenders_in_states

          permanent_name country_code
16            naresh2074           US
31     christina27976796           US
37             vikas1098           IN
39              qian1385           US
42              xigg8769           US
...                  ...          ...
19979        manrike5051           LA
19981         janell3482           US
19984         sheryl2462           US
19989            amy5291           US
19993          gokul8235           US

[3424 rows x 2 columns]

In [17]:
lenders_without_states = lender_states.loc[lender_states['country_code'].isnull()]
lenders_without_states

           permanent_name country_code
0                qian3013          NaN
1               reena6733          NaN
2                 mai5982          NaN
3          andrew86079135          NaN
4              nguyen6962          NaN
...                   ...          ...
19995         mohamed4338          NaN
19996  vicrennaisance8567          NaN
19997           mariz6787          NaN
19998          julian2868          NaN
19999         lestine1570          NaN

[16576 rows x 2 columns]

In [20]:
lent_and_state = pd.merge(left=lent_by_lender, right=lenders_in_states, left_on='lender_x', right_on='permanent_name')
lent_total = lent_and_state['precise_amount'].sum()
lent_by_state = lent_and_state.groupby(['country_code'], as_index = False).agg({'precise_amount':['count', 'sum', lambda x: x.sum()/lent_total]})
lent_by_state.columns = lent_by_state.columns.droplevel(0)
lent_by_state

       count        sum  <lambda_0>
0  AU      1  33.333333    0.431034
1  US      1  44.000000    0.568966

**10.** Which country has the highest ratio between the difference computed at the previous point and the population?

**11.** Which country has the highest ratio between the difference computed at point 9 and the population that is not below the poverty line?

**12.** For each year, compute the total amount of loans. Each loan that has planned expiration time and disburse time in different years must have its amount distributed proportionally to the number of days in each year. For example, a loan with disburse time December 1st, 2016, planned expiration time January 30th 2018, and amount 5000USD has an amount of 5000USD * 31 / (31+365+30) = 363.85 for 2016, 5000USD * 365 / (31+365+30) = 4284.04 for 2017, and 5000USD * 30 / (31+365+30) = 352.11 for 2018.